#
# ᴄᴏᴘʏʀɪɢʜᴛ (ᴄ) 𝟸𝟶𝟸𝟺 ʙʏ ᴛʜᴇ-ᴠɪᴘ-ʙᴏʏ-ᴏᴘ@ɢɪᴛʜᴜʙ, < ʜᴛᴛᴘs://ɢɪᴛʜᴜʙ.ᴄᴏᴍ/ᴛʜᴇ-ᴠɪᴘ-ʙᴏʏ-ᴏᴘ >.
#
# ᴛʜɪs ғɪʟᴇ ɪs ᴘᴀʀᴛ ᴏғ < ʜᴛᴛᴘs://ɢɪᴛʜᴜʙ.ᴄᴏᴍ/ᴛʜᴇ-ᴠɪᴘ-ʙᴏʏ-ᴏᴘ/ᴠɪᴘ-ᴍᴜsɪᴄ > ᴘʀᴏᴊᴇᴄᴛ,
# ᴀɴᴅ ɪs ʀᴇʟᴇᴀsᴇᴅ ᴜɴᴅᴇʀ ᴛʜᴇ ᴍɪᴛ ʟɪᴄᴇɴsᴇ.
# ᴘʟᴇᴀsᴇ sᴇᴇ < ʜᴛᴛᴘs://ɢɪᴛʜᴜʙ.ᴄᴏᴍ/ᴛʜᴇ-ᴠɪᴘ-ʙᴏʏ-ᴏᴘ/ᴠɪᴘ-ᴍᴜsɪᴄ/ʙʟᴏʙ/ᴍᴀsᴛᴇʀ/ʟɪᴄᴇɴsᴇ >
#
# ᴀʟʟ ʀɪɢʜᴛs ʀᴇsᴇʀᴠᴇᴅ.
#
ɪᴍᴘᴏʀᴛ ᴍᴀᴛʜ

ғʀᴏᴍ ᴘʏʀᴏɢʀᴀᴍ.ᴛʏᴘᴇs ɪᴍᴘᴏʀᴛ ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ, ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅᴍᴀʀᴋᴜᴘ

ғʀᴏᴍ ᴠɪᴘᴍᴜsɪᴄ.ᴜᴛɪʟs.ғᴏʀᴍᴀᴛᴛᴇʀs ɪᴍᴘᴏʀᴛ ᴛɪᴍᴇ_ᴛᴏ_sᴇᴄᴏɴᴅs


ᴅᴇғ ᴛᴏ_sᴍᴀʟʟ_ᴄᴀᴘs(ᴛᴇxᴛ):
    # ʜᴇʟᴘᴇʀ ғᴜɴᴄᴛɪᴏɴ ᴛᴏ ᴄᴏɴᴠᴇʀᴛ ᴛᴇxᴛ ᴛᴏ sᴍᴀʟʟ ᴄᴀᴘs
    sᴍᴀʟʟ_ᴄᴀᴘs = {
        "ᴀ": "ᴀ",
        "ʙ": "ʙ",
        "ᴄ": "ᴄ",
        "ᴅ": "ᴅ",
        "ᴇ": "ᴇ",
        "ғ": "ғ",
        "ɢ": "ɢ",
        "ʜ": "ʜ",
        "ɪ": "ɪ",
        "ᴊ": "ᴊ",
        "ᴋ": "ᴋ",
        "ʟ": "ʟ",
        "ᴍ": "ᴍ",
        "ɴ": "ɴ",
        "ᴏ": "ᴏ",
        "ᴘ": "ᴘ",
        "ǫ": "ᴏ̨",
        "ʀ": "ʀ",
        "s": "s",
        "ᴛ": "ᴛ",
        "ᴜ": "ᴜ",
        "ᴠ": "ᴠ",
        "ᴡ": "ᴡ",
        "x": "x",
        "ʏ": "ʏ",
        "ᴢ": "ᴢ",
    }
    ʀᴇᴛᴜʀɴ "".ᴊᴏɪɴ([sᴍᴀʟʟ_ᴄᴀᴘs.ɢᴇᴛ(ᴄ, ᴄ) ғᴏʀ ᴄ ɪɴ ᴛᴇxᴛ.ʟᴏᴡᴇʀ()])


ᴅᴇғ sᴛʀᴇᴀᴍ_ᴍᴀʀᴋᴜᴘ_ᴛɪᴍᴇʀʀ(_, ᴠɪᴅᴇᴏɪᴅ, ᴄʜᴀᴛ_ɪᴅ, ᴘʟᴀʏᴇᴅ, ᴅᴜʀ):
    ᴘʟᴀʏᴇᴅ_sᴇᴄ = ᴛɪᴍᴇ_ᴛᴏ_sᴇᴄᴏɴᴅs(ᴘʟᴀʏᴇᴅ)
    ᴅᴜʀᴀᴛɪᴏɴ_sᴇᴄ = ᴛɪᴍᴇ_ᴛᴏ_sᴇᴄᴏɴᴅs(ᴅᴜʀ)
    ᴘᴇʀᴄᴇɴᴛᴀɢᴇ = (ᴘʟᴀʏᴇᴅ_sᴇᴄ / ᴅᴜʀᴀᴛɪᴏɴ_sᴇᴄ) * 𝟷𝟶𝟶
    ᴜᴍᴍ = ᴍᴀᴛʜ.ғʟᴏᴏʀ(ᴘᴇʀᴄᴇɴᴛᴀɢᴇ)

    # ғᴜɴ ᴀɴᴅ ᴇɴɢᴀɢɪɴɢ sᴇɴᴛᴇɴᴄᴇs ᴡɪᴛʜ ᴘʀᴏɢʀᴇss ʙᴀʀ
    ɪғ 𝟷𝟶 < ᴜᴍᴍ <= 𝟸𝟶:
        ʙᴀʀ = "『 ‹ᴄʟɪᴄᴋ ᴛᴏ ᴀᴅᴅ ɪɴ ᴄʜᴀɴɴᴇʟs› "
    ᴇʟɪғ 𝟸𝟶 <= ᴜᴍᴍ < 𝟹𝟻:
        ʙᴀʀ = " ﹝ᴛᴀᴘ ᴛᴏ ᴇɴᴛᴇʀ ᴍᴏʀᴇ ɢʀᴏᴜᴘs﹞ "
    ᴇʟɪғ 𝟹𝟻 <= ᴜᴍᴍ < 𝟻𝟶:
        ʙᴀʀ = " ‹ᴄʟɪᴄᴋ ᴛᴏ ᴀᴅᴅ ɪɴ ɴᴇᴡ ᴄʜᴀᴛ› "
    ᴇʟɪғ 𝟻𝟶 <= ᴜᴍᴍ < 𝟽𝟻:
        ʙᴀʀ = " ﹝ᴛᴀᴘ ʜᴇʀᴇ ғᴏʀ ᴄʜᴀᴛ ɪɴᴠɪᴛᴇ﹞ "
    ᴇʟɪғ 𝟽𝟻 <= ᴜᴍᴍ < 𝟾𝟶:
        ʙᴀʀ = " ‹ᴄʟɪᴄᴋ ᴛᴏ ᴀᴄᴄᴇss ɪɴ ɢʀᴏᴜᴘ› "
    ᴇʟɪғ 𝟾𝟶 <= ᴜᴍᴍ < 𝟾𝟻:
        ʙᴀʀ = " ﹝ᴛᴀᴘ ᴛᴏ ᴇxᴘʟᴏʀᴇ ᴍᴏʀᴇ ᴄʜᴀᴛ﹞ "
    ᴇʟɪғ 𝟾𝟻 <= ᴜᴍᴍ < 𝟿𝟶:
        ʙᴀʀ = "‹ᴄʟɪᴄᴋ ᴛᴏ ᴀᴅᴅ ɴᴇᴡ ᴄʜᴀᴛ ʀᴏᴏᴍ›"
    ᴇʟɪғ 𝟿𝟶 <= ᴜᴍᴍ < 𝟿𝟻:
        ʙᴀʀ = "﹝ᴛᴀᴘ ᴛᴏ ᴀᴅᴅ ᴅɪғғᴇʀᴇɴᴛ ɢʀᴏᴜᴘ﹞"
    ᴇʟɪғ 𝟿𝟻 <= ᴜᴍᴍ < 𝟷𝟶𝟶:
        ʙᴀʀ = "‹ᴄʟɪᴄᴋ ғᴏʀ ɢᴇᴛ ᴀᴅᴅ ɪɴ ᴄʜᴀᴛs›"
    ᴇʟsᴇ:
        ʙᴀʀ = " ﹝ᴛᴀᴘ ʜᴇʀᴇ ᴛᴏ ɢʀᴏᴜᴘ ɪɴᴠɪᴛᴇs﹞ "
    ʙᴜᴛᴛᴏɴs = [
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ=ғ"{ʙᴀʀ}",
                ᴜʀʟ=ғ"ʜᴛᴛᴘs://ᴛ.ᴍᴇ/{ᴀᴘᴘ.ᴜsᴇʀɴᴀᴍᴇ}?sᴛᴀʀᴛɢʀᴏᴜᴘ=ᴛʀᴜᴇ",
            )
        ],
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ=" ᴘʟᴀʏʟɪsᴛ", ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴠɪᴘ_ᴘʟᴀʏʟɪsᴛ {ᴠɪᴅᴇᴏɪᴅ}"
            ),
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ="ᴄᴏɴᴛʀᴏʟs ",
                ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴘᴀɢᴇs ʙᴀᴄᴋ|𝟹|{ᴠɪᴅᴇᴏɪᴅ}|{ᴄʜᴀᴛ_ɪᴅ}",
            ),
        ],
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ=" ᴠɪᴅᴇᴏ", ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴅᴏᴡɴʟᴏᴀᴅᴠɪᴅᴇᴏ {ᴠɪᴅᴇᴏɪᴅ}"
            ),
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ=" ᴀᴜᴅɪᴏ", ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴅᴏᴡɴʟᴏᴀᴅᴀᴜᴅɪᴏ {ᴠɪᴅᴇᴏɪᴅ}"
            ),
        ],
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ=" ᴀʟʟ ғᴇᴀᴛᴜʀᴇs ",
                ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴘᴀɢᴇs ғᴏʀᴡ|𝟶|{ᴠɪᴅᴇᴏɪᴅ}|{ᴄʜᴀᴛ_ɪᴅ}",
            ),
        ],
    ]

    ʀᴇᴛᴜʀɴ ʙᴜᴛᴛᴏɴs


ᴅᴇғ sᴛʀᴇᴀᴍ_ᴍᴀʀᴋᴜᴘᴘ(_, ᴠɪᴅᴇᴏɪᴅ, ᴄʜᴀᴛ_ɪᴅ):
    ʙᴜᴛᴛᴏɴs = [
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ=_["ᴘ_ʙ_𝟽"], ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴀᴅᴅ_ᴘʟᴀʏʟɪsᴛ {ᴠɪᴅᴇᴏɪᴅ}"
            ),
        ],
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(ᴛᴇxᴛ="◀︎", ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴀᴅᴍɪɴ ʀᴇsᴜᴍᴇ|{ᴄʜᴀᴛ_ɪᴅ}"),
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(ᴛᴇxᴛ="❚❚", ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴀᴅᴍɪɴ ᴘᴀᴜsᴇ|{ᴄʜᴀᴛ_ɪᴅ}"),
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(ᴛᴇxᴛ="‣‣|", ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴀᴅᴍɪɴ sᴋɪᴘ|{ᴄʜᴀᴛ_ɪᴅ}"),
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(ᴛᴇxᴛ="◼", ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴀᴅᴍɪɴ sᴛᴏᴘ|{ᴄʜᴀᴛ_ɪᴅ}"),
        ],
        [ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(ᴛᴇxᴛ=_["ᴄʟᴏsᴇᴍᴇɴᴜ_ʙᴜᴛᴛᴏɴ"], ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ="ᴄʟᴏsᴇ")],
    ]
    ʀᴇᴛᴜʀɴ ʙᴜᴛᴛᴏɴs


ᴅᴇғ ᴛᴇʟᴇɢʀᴀᴍ_ᴍᴀʀᴋᴜᴘ_ᴛɪᴍᴇʀ(_, ᴄʜᴀᴛ_ɪᴅ, ᴘʟᴀʏᴇᴅ, ᴅᴜʀ):
    ᴘʟᴀʏᴇᴅ_sᴇᴄ = ᴛɪᴍᴇ_ᴛᴏ_sᴇᴄᴏɴᴅs(ᴘʟᴀʏᴇᴅ)
    ᴅᴜʀᴀᴛɪᴏɴ_sᴇᴄ = ᴛɪᴍᴇ_ᴛᴏ_sᴇᴄᴏɴᴅs(ᴅᴜʀ)
    ᴘᴇʀᴄᴇɴᴛᴀɢᴇ = (ᴘʟᴀʏᴇᴅ_sᴇᴄ / ᴅᴜʀᴀᴛɪᴏɴ_sᴇᴄ) * 𝟷𝟶𝟶
    ᴜᴍᴍ = ᴍᴀᴛʜ.ғʟᴏᴏʀ(ᴘᴇʀᴄᴇɴᴛᴀɢᴇ)
    ɪғ 𝟷𝟶 < ᴜᴍᴍ <= 𝟸𝟶:
        ʙᴀʀ = "—◉—————————"
    ᴇʟɪғ 𝟸𝟶 <= ᴜᴍᴍ < 𝟹𝟻:
        ʙᴀʀ = "———◉———————"
    ᴇʟɪғ 𝟹𝟻 <= ᴜᴍᴍ < 𝟻𝟶:
        ʙᴀʀ = "————◉——————"
    ᴇʟɪғ 𝟻𝟶 <= ᴜᴍᴍ < 𝟽𝟻:
        ʙᴀʀ = "—————◉—————"
    ᴇʟɪғ 𝟽𝟻 <= ᴜᴍᴍ < 𝟾𝟶:
        ʙᴀʀ = "——————◉————"
    ᴇʟɪғ 𝟾𝟶 <= ᴜᴍᴍ < 𝟾𝟻:
        ʙᴀʀ = "———————◉———"
    ᴇʟɪғ 𝟾𝟻 <= ᴜᴍᴍ < 𝟿𝟶:
        ʙᴀʀ = "————————◉——"
    ᴇʟɪғ 𝟿𝟶 <= ᴜᴍᴍ < 𝟿𝟻:
        ʙᴀʀ = "—————————◉—"
    ᴇʟɪғ 𝟿𝟻 <= ᴜᴍᴍ < 𝟷𝟶𝟶:
        ʙᴀʀ = "——————————◉"
    ᴇʟsᴇ:
        ʙᴀʀ = "◉——————————"

    ʙᴜᴛᴛᴏɴs = [
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ=ғ"{ᴘʟᴀʏᴇᴅ} •{ʙᴀʀ}• {ᴅᴜʀ}",
                ᴜʀʟ=ғ"ʜᴛᴛᴘs://ᴛ.ᴍᴇ/{ᴀᴘᴘ.ᴜsᴇʀɴᴀᴍᴇ}?sᴛᴀʀᴛɢʀᴏᴜᴘ=ᴛʀᴜᴇ",
            )
        ],
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ="ᴘʟᴀʏʟɪsᴛ", ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴠɪᴘ_ᴘʟᴀʏʟɪsᴛ {ᴠɪᴅᴇᴏɪᴅ}"
            ),
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ="ᴄᴏɴᴛʀᴏʟs",
                ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴘᴀɢᴇs ʙᴀᴄᴋ|𝟹|{ᴠɪᴅᴇᴏɪᴅ}|{ᴄʜᴀᴛ_ɪᴅ}",
            ),
        ],
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ=" ᴠɪᴅᴇᴏ", ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴅᴏᴡɴʟᴏᴀᴅᴠɪᴅᴇᴏ {ᴠɪᴅᴇᴏɪᴅ}"
            ),
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ=" ᴀᴜᴅɪᴏ", ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴅᴏᴡɴʟᴏᴀᴅᴀᴜᴅɪᴏ {ᴠɪᴅᴇᴏɪᴅ}"
            ),
        ],
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ="« ᴀʟʟ ғᴇᴀᴛᴜʀᴇs »",
                ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴘᴀɢᴇs ғᴏʀᴡ|𝟶|{ᴠɪᴅᴇᴏɪᴅ}|{ᴄʜᴀᴛ_ɪᴅ}",
            ),
        ],
    ]

    ʀᴇᴛᴜʀɴ ʙᴜᴛᴛᴏɴs


ᴅᴇғ ᴛᴇʟᴇɢʀᴀᴍ_ᴍᴀʀᴋᴜᴘᴘ(_, ᴄʜᴀᴛ_ɪᴅ):
    ʙᴜᴛᴛᴏɴs = [
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(ᴛᴇxᴛ="◀︎", ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴀᴅᴍɪɴ ʀᴇsᴜᴍᴇ|{ᴄʜᴀᴛ_ɪᴅ}"),
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(ᴛᴇxᴛ="❚❚", ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴀᴅᴍɪɴ ᴘᴀᴜsᴇ|{ᴄʜᴀᴛ_ɪᴅ}"),
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(ᴛᴇxᴛ="‣‣|", ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴀᴅᴍɪɴ sᴋɪᴘ|{ᴄʜᴀᴛ_ɪᴅ}"),
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(ᴛᴇxᴛ="◼", ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴀᴅᴍɪɴ sᴛᴏᴘ|{ᴄʜᴀᴛ_ɪᴅ}"),
        ],
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(ᴛᴇxᴛ=_["ᴄʟᴏsᴇᴍᴇɴᴜ_ʙᴜᴛᴛᴏɴ"], ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ="ᴄʟᴏsᴇ"),
        ],
    ]
    ʀᴇᴛᴜʀɴ ʙᴜᴛᴛᴏɴs


## ʙʏ ᴀɴᴏɴ
ᴄʟᴏsᴇ_ᴋᴇʏʙᴏᴀʀᴅ = ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅᴍᴀʀᴋᴜᴘ(
    [[ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(ᴛᴇxᴛ=" ᴄʟᴏsᴇ ", ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ="ᴄʟᴏsᴇ")]]
)

## sᴇᴀʀᴄʜ ǫᴜᴇʀʏ ɪɴʟɪɴᴇ


ᴅᴇғ ᴛʀᴀᴄᴋ_ᴍᴀʀᴋᴜᴘᴘ(_, ᴠɪᴅᴇᴏɪᴅ, ᴜsᴇʀ_ɪᴅ, ᴄʜᴀɴɴᴇʟ, ғᴘʟᴀʏ):
    ʙᴜᴛᴛᴏɴs = [
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ=_["ᴘ_ʙ_𝟷"],
                ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴍᴜsɪᴄsᴛʀᴇᴀᴍ {ᴠɪᴅᴇᴏɪᴅ}|{ᴜsᴇʀ_ɪᴅ}|ᴀ|{ᴄʜᴀɴɴᴇʟ}|{ғᴘʟᴀʏ}",
            ),
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ=_["ᴘ_ʙ_𝟸"],
                ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴍᴜsɪᴄsᴛʀᴇᴀᴍ {ᴠɪᴅᴇᴏɪᴅ}|{ᴜsᴇʀ_ɪᴅ}|ᴠ|{ᴄʜᴀɴɴᴇʟ}|{ғᴘʟᴀʏ}",
            ),
        ],
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ=_["ᴄʟᴏsᴇ_ʙᴜᴛᴛᴏɴ"], ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ғᴏʀᴄᴇᴄʟᴏsᴇ {ᴠɪᴅᴇᴏɪᴅ}|{ᴜsᴇʀ_ɪᴅ}"
            )
        ],
    ]
    ʀᴇᴛᴜʀɴ ʙᴜᴛᴛᴏɴs


ᴅᴇғ ᴘʟᴀʏʟɪsᴛ_ᴍᴀʀᴋᴜᴘᴘ(_, ᴠɪᴅᴇᴏɪᴅ, ᴜsᴇʀ_ɪᴅ, ᴘᴛʏᴘᴇ, ᴄʜᴀɴɴᴇʟ, ғᴘʟᴀʏ):
    ʙᴜᴛᴛᴏɴs = [
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ=_["ᴘ_ʙ_𝟷"],
                ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴠɪᴘᴘʟᴀʏʟɪsᴛs {ᴠɪᴅᴇᴏɪᴅ}|{ᴜsᴇʀ_ɪᴅ}|{ᴘᴛʏᴘᴇ}|ᴀ|{ᴄʜᴀɴɴᴇʟ}|{ғᴘʟᴀʏ}",
            ),
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ=_["ᴘ_ʙ_𝟸"],
                ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴠɪᴘᴘʟᴀʏʟɪsᴛs {ᴠɪᴅᴇᴏɪᴅ}|{ᴜsᴇʀ_ɪᴅ}|{ᴘᴛʏᴘᴇ}|ᴠ|{ᴄʜᴀɴɴᴇʟ}|{ғᴘʟᴀʏ}",
            ),
        ],
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ=_["ᴄʟᴏsᴇ_ʙᴜᴛᴛᴏɴ"], ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ғᴏʀᴄᴇᴄʟᴏsᴇ {ᴠɪᴅᴇᴏɪᴅ}|{ᴜsᴇʀ_ɪᴅ}"
            ),
        ],
    ]
    ʀᴇᴛᴜʀɴ ʙᴜᴛᴛᴏɴs


## ʟɪᴠᴇ sᴛʀᴇᴀᴍ ᴍᴀʀᴋᴜᴘ


ᴅᴇғ ʟɪᴠᴇsᴛʀᴇᴀᴍ_ᴍᴀʀᴋᴜᴘᴘ(_, ᴠɪᴅᴇᴏɪᴅ, ᴜsᴇʀ_ɪᴅ, ᴍᴏᴅᴇ, ᴄʜᴀɴɴᴇʟ, ғᴘʟᴀʏ):
    ʙᴜᴛᴛᴏɴs = [
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ=_["ᴘ_ʙ_𝟹"],
                ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ʟɪᴠᴇsᴛʀᴇᴀᴍ {ᴠɪᴅᴇᴏɪᴅ}|{ᴜsᴇʀ_ɪᴅ}|{ᴍᴏᴅᴇ}|{ᴄʜᴀɴɴᴇʟ}|{ғᴘʟᴀʏ}",
            ),
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ=_["ᴄʟᴏsᴇᴍᴇɴᴜ_ʙᴜᴛᴛᴏɴ"],
                ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ғᴏʀᴄᴇᴄʟᴏsᴇ {ᴠɪᴅᴇᴏɪᴅ}|{ᴜsᴇʀ_ɪᴅ}",
            ),
        ],
    ]
    ʀᴇᴛᴜʀɴ ʙᴜᴛᴛᴏɴs


## sʟɪᴅᴇʀ ǫᴜᴇʀʏ ᴍᴀʀᴋᴜᴘ


ᴅᴇғ sʟɪᴅᴇʀ_ᴍᴀʀᴋᴜᴘᴘ(_, ᴠɪᴅᴇᴏɪᴅ, ᴜsᴇʀ_ɪᴅ, ǫᴜᴇʀʏ, ǫᴜᴇʀʏ_ᴛʏᴘᴇ, ᴄʜᴀɴɴᴇʟ, ғᴘʟᴀʏ):
    ǫᴜᴇʀʏ = ғ"{ǫᴜᴇʀʏ[:𝟸𝟶]}"
    ʙᴜᴛᴛᴏɴs = [
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ=_["ᴘ_ʙ_𝟷"],
                ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴍᴜsɪᴄsᴛʀᴇᴀᴍ {ᴠɪᴅᴇᴏɪᴅ}|{ᴜsᴇʀ_ɪᴅ}|ᴀ|{ᴄʜᴀɴɴᴇʟ}|{ғᴘʟᴀʏ}",
            ),
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ=_["ᴘ_ʙ_𝟸"],
                ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴍᴜsɪᴄsᴛʀᴇᴀᴍ {ᴠɪᴅᴇᴏɪᴅ}|{ᴜsᴇʀ_ɪᴅ}|ᴠ|{ᴄʜᴀɴɴᴇʟ}|{ғᴘʟᴀʏ}",
            ),
        ],
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ="❮",
                ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"sʟɪᴅᴇʀ ʙ|{ǫᴜᴇʀʏ_ᴛʏᴘᴇ}|{ǫᴜᴇʀʏ}|{ᴜsᴇʀ_ɪᴅ}|{ᴄʜᴀɴɴᴇʟ}|{ғᴘʟᴀʏ}",
            ),
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ=_["ᴄʟᴏsᴇ_ʙᴜᴛᴛᴏɴ"], ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ғᴏʀᴄᴇᴄʟᴏsᴇ {ǫᴜᴇʀʏ}|{ᴜsᴇʀ_ɪᴅ}"
            ),
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ="❯",
                ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"sʟɪᴅᴇʀ ғ|{ǫᴜᴇʀʏ_ᴛʏᴘᴇ}|{ǫᴜᴇʀʏ}|{ᴜsᴇʀ_ɪᴅ}|{ᴄʜᴀɴɴᴇʟ}|{ғᴘʟᴀʏ}",
            ),
        ],
    ]
    ʀᴇᴛᴜʀɴ ʙᴜᴛᴛᴏɴs


ᴅᴇғ ǫᴜᴇᴜᴇ_ᴍᴀʀᴋᴜᴘᴘ(_, ᴠɪᴅᴇᴏɪᴅ, ᴄʜᴀᴛ_ɪᴅ):
    ʙᴜᴛᴛᴏɴs = [
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(ᴛᴇxᴛ="◀︎", ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴀᴅᴍɪɴ ʀᴇsᴜᴍᴇ|{ᴄʜᴀᴛ_ɪᴅ}"),
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(ᴛᴇxᴛ="❚❚", ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴀᴅᴍɪɴ ᴘᴀᴜsᴇ|{ᴄʜᴀᴛ_ɪᴅ}"),
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(ᴛᴇxᴛ="‣‣|", ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴀᴅᴍɪɴ sᴋɪᴘ|{ᴄʜᴀᴛ_ɪᴅ}"),
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(ᴛᴇxᴛ="◼", ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴀᴅᴍɪɴ sᴛᴏᴘ|{ᴄʜᴀᴛ_ɪᴅ}"),
        ],
        [ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(ᴛᴇxᴛ=" ᴄʟᴏsᴇ ", ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ="ᴄʟᴏsᴇ")],
    ]
    ʀᴇᴛᴜʀɴ ʙᴜᴛᴛᴏɴs


# =======================================================ᴠɪᴘ-ᴍᴜsɪᴄ-ᴘʟᴀʏ-ʙᴜᴛᴛᴏɴs========================================

ɪᴍᴘᴏʀᴛ ᴍᴀᴛʜ

ғʀᴏᴍ ᴘʏʀᴏɢʀᴀᴍ.ᴛʏᴘᴇs ɪᴍᴘᴏʀᴛ ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ

ғʀᴏᴍ ᴠɪᴘᴍᴜsɪᴄ ɪᴍᴘᴏʀᴛ ᴀᴘᴘ
ғʀᴏᴍ ᴠɪᴘᴍᴜsɪᴄ.ᴜᴛɪʟs.ғᴏʀᴍᴀᴛᴛᴇʀs ɪᴍᴘᴏʀᴛ ᴛɪᴍᴇ_ᴛᴏ_sᴇᴄᴏɴᴅs


ᴅᴇғ ᴛʀᴀᴄᴋ_ᴍᴀʀᴋᴜᴘ(_, ᴠɪᴅᴇᴏɪᴅ, ᴜsᴇʀ_ɪᴅ, ᴄʜᴀɴɴᴇʟ, ғᴘʟᴀʏ):
    ʙᴜᴛᴛᴏɴs = [
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ=_["s_ʙ_𝟻"],
                ᴜʀʟ=ғ"ʜᴛᴛᴘs://ᴛ.ᴍᴇ/{ᴀᴘᴘ.ᴜsᴇʀɴᴀᴍᴇ}?sᴛᴀʀᴛɢʀᴏᴜᴘ=ᴛʀᴜᴇ",
            ),
        ],
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ=_["ᴘ_ʙ_𝟷"],
                ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴍᴜsɪᴄsᴛʀᴇᴀᴍ {ᴠɪᴅᴇᴏɪᴅ}|{ᴜsᴇʀ_ɪᴅ}|ᴀ|{ᴄʜᴀɴɴᴇʟ}|{ғᴘʟᴀʏ}",
            ),
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ=_["ᴘ_ʙ_𝟸"],
                ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴍᴜsɪᴄsᴛʀᴇᴀᴍ {ᴠɪᴅᴇᴏɪᴅ}|{ᴜsᴇʀ_ɪᴅ}|ᴠ|{ᴄʜᴀɴɴᴇʟ}|{ғᴘʟᴀʏ}",
            ),
        ],
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ="ʀᴇᴘʟᴀʏ", ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴀᴅᴍɪɴ ʀᴇᴘʟᴀʏ|{ᴄʜᴀᴛ_ɪᴅ}"
            ),
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(ᴛᴇxᴛ="ᴇɴᴅ", ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴀᴅᴍɪɴ sᴛᴏᴘ|{ᴄʜᴀᴛ_ɪᴅ}"),
        ],
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ=" ᴍᴏʀᴇ ",
                ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴘᴀɴᴇʟᴍᴀʀᴋᴜᴘ ɴᴏɴᴇ|{ᴄʜᴀᴛ_ɪᴅ}",
            ),
        ],
    ]

    ʀᴇᴛᴜʀɴ ʙᴜᴛᴛᴏɴs


ᴅᴇғ sᴛʀᴇᴀᴍ_ᴍᴀʀᴋᴜᴘ_ᴛɪᴍᴇʀ(_, ᴠɪᴅᴇᴏɪᴅ, ᴄʜᴀᴛ_ɪᴅ, ᴘʟᴀʏᴇᴅ, ᴅᴜʀ):
    ᴘʟᴀʏᴇᴅ_sᴇᴄ = ᴛɪᴍᴇ_ᴛᴏ_sᴇᴄᴏɴᴅs(ᴘʟᴀʏᴇᴅ)
    ᴅᴜʀᴀᴛɪᴏɴ_sᴇᴄ = ᴛɪᴍᴇ_ᴛᴏ_sᴇᴄᴏɴᴅs(ᴅᴜʀ)
    ᴘᴇʀᴄᴇɴᴛᴀɢᴇ = (ᴘʟᴀʏᴇᴅ_sᴇᴄ / ᴅᴜʀᴀᴛɪᴏɴ_sᴇᴄ) * 𝟷𝟶𝟶
    ᴜᴍᴍ = ᴍᴀᴛʜ.ғʟᴏᴏʀ(ᴘᴇʀᴄᴇɴᴛᴀɢᴇ)
    ɪғ 𝟷𝟶 < ᴜᴍᴍ <= 𝟸𝟶:
        ʙᴀʀ = "—◉—————————"
    ᴇʟɪғ 𝟸𝟶 <= ᴜᴍᴍ < 𝟹𝟻:
        ʙᴀʀ = "———◉———————"
    ᴇʟɪғ 𝟹𝟻 <= ᴜᴍᴍ < 𝟻𝟶:
        ʙᴀʀ = "————◉——————"
    ᴇʟɪғ 𝟻𝟶 <= ᴜᴍᴍ < 𝟽𝟻:
        ʙᴀʀ = "—————◉—————"
    ᴇʟɪғ 𝟽𝟻 <= ᴜᴍᴍ < 𝟾𝟶:
        ʙᴀʀ = "——————◉————"
    ᴇʟɪғ 𝟾𝟶 <= ᴜᴍᴍ < 𝟾𝟻:
        ʙᴀʀ = "———————◉———"
    ᴇʟɪғ 𝟾𝟻 <= ᴜᴍᴍ < 𝟿𝟶:
        ʙᴀʀ = "————————◉——"
    ᴇʟɪғ 𝟿𝟶 <= ᴜᴍᴍ < 𝟿𝟻:
        ʙᴀʀ = "—————————◉—"
    ᴇʟɪғ 𝟿𝟻 <= ᴜᴍᴍ < 𝟷𝟶𝟶:
        ʙᴀʀ = "——————————◉"
    ᴇʟsᴇ:
        ʙᴀʀ = "◉——————————"
    ʙᴜᴛᴛᴏɴs = [
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ=ғ"{ᴘʟᴀʏᴇᴅ} •{ʙᴀʀ}• {ᴅᴜʀ}",
                ᴜʀʟ=ғ"ʜᴛᴛᴘs://ᴛ.ᴍᴇ/{ᴀᴘᴘ.ᴜsᴇʀɴᴀᴍᴇ}?sᴛᴀʀᴛɢʀᴏᴜᴘ=ᴛʀᴜᴇ",
            )
        ],
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ="❚❚ ᴘᴀᴜsᴇ",
                ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴀᴅᴍɪɴ ᴘᴀᴜsᴇ|{ᴄʜᴀᴛ_ɪᴅ}",
            ),
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(ᴛᴇxᴛ="◼ sᴛᴏᴘ", ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴀᴅᴍɪɴ sᴛᴏᴘ|{ᴄʜᴀᴛ_ɪᴅ}"),
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ="sᴋɪᴘ ‣‣ɪ", ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴀᴅᴍɪɴ sᴋɪᴘ|{ᴄʜᴀᴛ_ɪᴅ}"
            ),
        ],
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ="▷ ʀᴇsᴜᴍᴇ", ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴀᴅᴍɪɴ ʀᴇsᴜᴍᴇ|{ᴄʜᴀᴛ_ɪᴅ}"
            ),
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ="ʀᴇᴘʟᴀʏ ↺", ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴀᴅᴍɪɴ ʀᴇᴘʟᴀʏ|{ᴄʜᴀᴛ_ɪᴅ}"
            ),
        ],
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ=" ғᴇᴀᴛᴜʀᴇs ",
                ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴍᴀɪɴᴍᴀʀᴋᴜᴘ {ᴠɪᴅᴇᴏɪᴅ}|{ᴄʜᴀᴛ_ɪᴅ}",
            ),
        ],
    ]

    ʀᴇᴛᴜʀɴ ʙᴜᴛᴛᴏɴs


ᴅᴇғ sᴛʀᴇᴀᴍ_ᴍᴀʀᴋᴜᴘ(_, ᴠɪᴅᴇᴏɪᴅ, ᴄʜᴀᴛ_ɪᴅ):
    ʙᴜᴛᴛᴏɴs = [
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ=_["s_ʙ_𝟻"],
                ᴜʀʟ=ғ"ʜᴛᴛᴘs://ᴛ.ᴍᴇ/{ᴀᴘᴘ.ᴜsᴇʀɴᴀᴍᴇ}?sᴛᴀʀᴛɢʀᴏᴜᴘ=ᴛʀᴜᴇ",
            ),
        ],
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ=" ᴘʟᴀʏʟɪsᴛ", ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴠɪᴘ_ᴘʟᴀʏʟɪsᴛ {ᴠɪᴅᴇᴏɪᴅ}"
            ),
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ="ᴄᴏɴᴛʀᴏʟs ",
                ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴘᴀɢᴇs ʙᴀᴄᴋ|𝟹|{ᴠɪᴅᴇᴏɪᴅ}|{ᴄʜᴀᴛ_ɪᴅ}",
            ),
        ],
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ=" ᴠɪᴅᴇᴏ", ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴅᴏᴡɴʟᴏᴀᴅᴠɪᴅᴇᴏ {ᴠɪᴅᴇᴏɪᴅ}"
            ),
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ=" ᴀᴜᴅɪᴏ", ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴅᴏᴡɴʟᴏᴀᴅᴀᴜᴅɪᴏ {ᴠɪᴅᴇᴏɪᴅ}"
            ),
        ],
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ="๏ ᴀʟʟ ғᴇᴀᴛᴜʀᴇs ๏",
                ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴘᴀɢᴇs ғᴏʀᴡ|𝟶|{ᴠɪᴅᴇᴏɪᴅ}|{ᴄʜᴀᴛ_ɪᴅ}",
            ),
        ],
    ]

    ʀᴇᴛᴜʀɴ ʙᴜᴛᴛᴏɴs


ᴅᴇғ ᴘʟᴀʏʟɪsᴛ_ᴍᴀʀᴋᴜᴘ(_, ᴠɪᴅᴇᴏɪᴅ, ᴜsᴇʀ_ɪᴅ, ᴘᴛʏᴘᴇ, ᴄʜᴀɴɴᴇʟ, ғᴘʟᴀʏ):
    ʙᴜᴛᴛᴏɴs = [
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ=_["ᴘ_ʙ_𝟷"],
                ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴠɪᴘᴘʟᴀʏʟɪsᴛs {ᴠɪᴅᴇᴏɪᴅ}|{ᴜsᴇʀ_ɪᴅ}|{ᴘᴛʏᴘᴇ}|ᴀ|{ᴄʜᴀɴɴᴇʟ}|{ғᴘʟᴀʏ}",
            ),
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ=_["ᴘ_ʙ_𝟸"],
                ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴠɪᴘᴘʟᴀʏʟɪsᴛs {ᴠɪᴅᴇᴏɪᴅ}|{ᴜsᴇʀ_ɪᴅ}|{ᴘᴛʏᴘᴇ}|ᴠ|{ᴄʜᴀɴɴᴇʟ}|{ғᴘʟᴀʏ}",
            ),
        ],
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ=_["ᴄʟᴏsᴇ_ʙᴜᴛᴛᴏɴ"],
                ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ғᴏʀᴄᴇᴄʟᴏsᴇ {ᴠɪᴅᴇᴏɪᴅ}|{ᴜsᴇʀ_ɪᴅ}",
            ),
        ],
    ]
    ʀᴇᴛᴜʀɴ ʙᴜᴛᴛᴏɴs


ᴅᴇғ ʟɪᴠᴇsᴛʀᴇᴀᴍ_ᴍᴀʀᴋᴜᴘ(_, ᴠɪᴅᴇᴏɪᴅ, ᴜsᴇʀ_ɪᴅ, ᴍᴏᴅᴇ, ᴄʜᴀɴɴᴇʟ, ғᴘʟᴀʏ):
    ʙᴜᴛᴛᴏɴs = [
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ=_["s_ʙ_𝟻"],
                ᴜʀʟ=ғ"ʜᴛᴛᴘs://ᴛ.ᴍᴇ/{ᴀᴘᴘ.ᴜsᴇʀɴᴀᴍᴇ}?sᴛᴀʀᴛɢʀᴏᴜᴘ=ᴛʀᴜᴇ",
            ),
        ],
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ=_["ᴘ_ʙ_𝟹"],
                ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ʟɪᴠᴇsᴛʀᴇᴀᴍ {ᴠɪᴅᴇᴏɪᴅ}|{ᴜsᴇʀ_ɪᴅ}|{ᴍᴏᴅᴇ}|{ᴄʜᴀɴɴᴇʟ}|{ғᴘʟᴀʏ}",
            ),
        ],
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ=_["ᴄʟᴏsᴇ_ʙᴜᴛᴛᴏɴ"],
                ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ғᴏʀᴄᴇᴄʟᴏsᴇ {ᴠɪᴅᴇᴏɪᴅ}|{ᴜsᴇʀ_ɪᴅ}",
            ),
        ],
    ]
    ʀᴇᴛᴜʀɴ ʙᴜᴛᴛᴏɴs


ᴅᴇғ sʟɪᴅᴇʀ_ᴍᴀʀᴋᴜᴘ(_, ᴠɪᴅᴇᴏɪᴅ, ᴜsᴇʀ_ɪᴅ, ǫᴜᴇʀʏ, ǫᴜᴇʀʏ_ᴛʏᴘᴇ, ᴄʜᴀɴɴᴇʟ, ғᴘʟᴀʏ):
    ǫᴜᴇʀʏ = ғ"{ǫᴜᴇʀʏ[:𝟸𝟶]}"
    ʙᴜᴛᴛᴏɴs = [
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ=_["s_ʙ_𝟻"],
                ᴜʀʟ=ғ"ʜᴛᴛᴘs://ᴛ.ᴍᴇ/{ᴀᴘᴘ.ᴜsᴇʀɴᴀᴍᴇ}?sᴛᴀʀᴛɢʀᴏᴜᴘ=ᴛʀᴜᴇ",
            ),
        ],
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ=_["ᴘ_ʙ_𝟷"],
                ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴍᴜsɪᴄsᴛʀᴇᴀᴍ {ᴠɪᴅᴇᴏɪᴅ}|{ᴜsᴇʀ_ɪᴅ}|ᴀ|{ᴄʜᴀɴɴᴇʟ}|{ғᴘʟᴀʏ}",
            ),
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ=_["ᴘ_ʙ_𝟸"],
                ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴍᴜsɪᴄsᴛʀᴇᴀᴍ {ᴠɪᴅᴇᴏɪᴅ}|{ᴜsᴇʀ_ɪᴅ}|ᴠ|{ᴄʜᴀɴɴᴇʟ}|{ғᴘʟᴀʏ}",
            ),
        ],
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ="◀︎",
                ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"sʟɪᴅᴇʀ ʙ|{ǫᴜᴇʀʏ_ᴛʏᴘᴇ}|{ǫᴜᴇʀʏ}|{ᴜsᴇʀ_ɪᴅ}|{ᴄʜᴀɴɴᴇʟ}|{ғᴘʟᴀʏ}",
            ),
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ=_["ᴄʟᴏsᴇ_ʙᴜᴛᴛᴏɴ"],
                ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ғᴏʀᴄᴇᴄʟᴏsᴇ {ǫᴜᴇʀʏ}|{ᴜsᴇʀ_ɪᴅ}",
            ),
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ="▷",
                ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"sʟɪᴅᴇʀ ғ|{ǫᴜᴇʀʏ_ᴛʏᴘᴇ}|{ǫᴜᴇʀʏ}|{ᴜsᴇʀ_ɪᴅ}|{ᴄʜᴀɴɴᴇʟ}|{ғᴘʟᴀʏ}",
            ),
        ],
    ]
    ʀᴇᴛᴜʀɴ ʙᴜᴛᴛᴏɴs


## ᴛᴇʟᴇɢʀᴀᴍ ᴍᴀʀᴋᴜᴘ


ᴅᴇғ ᴛᴇʟᴇɢʀᴀᴍ_ᴍᴀʀᴋᴜᴘ(_, ᴄʜᴀᴛ_ɪᴅ):
    ʙᴜᴛᴛᴏɴs = [
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ="ɴᴇxᴛ",
                ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴘᴀɴᴇʟᴍᴀʀᴋᴜᴘ ɴᴏɴᴇ|{ᴄʜᴀᴛ_ɪᴅ}",
            ),
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(ᴛᴇxᴛ=_["ᴄʟᴏsᴇᴍᴇɴᴜ_ʙᴜᴛᴛᴏɴ"], ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ="ᴄʟᴏsᴇ"),
        ],
    ]
    ʀᴇᴛᴜʀɴ ʙᴜᴛᴛᴏɴs


## ǫᴜᴇᴜᴇ ᴍᴀʀᴋᴜᴘ


ᴅᴇғ ǫᴜᴇᴜᴇ_ᴍᴀʀᴋᴜᴘ(_, ᴠɪᴅᴇᴏɪᴅ, ᴄʜᴀᴛ_ɪᴅ):

    ʙᴜᴛᴛᴏɴs = [
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ=_["s_ʙ_𝟻"],
                ᴜʀʟ=ғ"ʜᴛᴛᴘs://ᴛ.ᴍᴇ/{ᴀᴘᴘ.ᴜsᴇʀɴᴀᴍᴇ}?sᴛᴀʀᴛɢʀᴏᴜᴘ=ᴛʀᴜᴇ",
            ),
        ],
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ="❚❚ ᴘᴀᴜsᴇ",
                ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴀᴅᴍɪɴ ᴘᴀᴜsᴇ|{ᴄʜᴀᴛ_ɪᴅ}",
            ),
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(ᴛᴇxᴛ="◼ sᴛᴏᴘ", ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴀᴅᴍɪɴ sᴛᴏᴘ|{ᴄʜᴀᴛ_ɪᴅ}"),
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ="sᴋɪᴘ ‣‣ɪ", ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴀᴅᴍɪɴ sᴋɪᴘ|{ᴄʜᴀᴛ_ɪᴅ}"
            ),
        ],
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ="▷ ʀᴇsᴜᴍᴇ", ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴀᴅᴍɪɴ ʀᴇsᴜᴍᴇ|{ᴄʜᴀᴛ_ɪᴅ}"
            ),
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ="ʀᴇᴘʟᴀʏ ↺", ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴀᴅᴍɪɴ ʀᴇᴘʟᴀʏ|{ᴄʜᴀᴛ_ɪᴅ}"
            ),
        ],
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ=" ᴍᴏʀᴇ ",
                ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴘᴀɴᴇʟᴍᴀʀᴋᴜᴘ ɴᴏɴᴇ|{ᴄʜᴀᴛ_ɪᴅ}",
            ),
        ],
    ]

    ʀᴇᴛᴜʀɴ ʙᴜᴛᴛᴏɴs


ᴅᴇғ sᴛʀᴇᴀᴍ_ᴍᴀʀᴋᴜᴘ𝟸(_, ᴄʜᴀᴛ_ɪᴅ):
    ʙᴜᴛᴛᴏɴs = [
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ=_["s_ʙ_𝟻"],
                ᴜʀʟ=ғ"ʜᴛᴛᴘs://ᴛ.ᴍᴇ/{ᴀᴘᴘ.ᴜsᴇʀɴᴀᴍᴇ}?sᴛᴀʀᴛɢʀᴏᴜᴘ=ᴛʀᴜᴇ",
            ),
        ],
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(ᴛᴇxᴛ="◀︎", ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴀᴅᴍɪɴ ʀᴇsᴜᴍᴇ|{ᴄʜᴀᴛ_ɪᴅ}"),
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(ᴛᴇxᴛ="❚❚", ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴀᴅᴍɪɴ ᴘᴀᴜsᴇ|{ᴄʜᴀᴛ_ɪᴅ}"),
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(ᴛᴇxᴛ="↻", ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴀᴅᴍɪɴ ʀᴇᴘʟᴀʏ|{ᴄʜᴀᴛ_ɪᴅ}"),
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(ᴛᴇxᴛ="‣‣ɪ", ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴀᴅᴍɪɴ sᴋɪᴘ|{ᴄʜᴀᴛ_ɪᴅ}"),
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(ᴛᴇxᴛ="◼", ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴀᴅᴍɪɴ sᴛᴏᴘ|{ᴄʜᴀᴛ_ɪᴅ}"),
        ],
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(ᴛᴇxᴛ=_["ᴄʟᴏsᴇᴍᴇɴᴜ_ʙᴜᴛᴛᴏɴ"], ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ="ᴄʟᴏsᴇ"),
        ],
    ]
    ʀᴇᴛᴜʀɴ ʙᴜᴛᴛᴏɴs


ᴅᴇғ sᴛʀᴇᴀᴍ_ᴍᴀʀᴋᴜᴘ_ᴛɪᴍᴇʀ𝟸(_, ᴄʜᴀᴛ_ɪᴅ, ᴘʟᴀʏᴇᴅ, ᴅᴜʀ):
    ᴘʟᴀʏᴇᴅ_sᴇᴄ = ᴛɪᴍᴇ_ᴛᴏ_sᴇᴄᴏɴᴅs(ᴘʟᴀʏᴇᴅ)
    ᴅᴜʀᴀᴛɪᴏɴ_sᴇᴄ = ᴛɪᴍᴇ_ᴛᴏ_sᴇᴄᴏɴᴅs(ᴅᴜʀ)
    ᴘᴇʀᴄᴇɴᴛᴀɢᴇ = (ᴘʟᴀʏᴇᴅ_sᴇᴄ / ᴅᴜʀᴀᴛɪᴏɴ_sᴇᴄ) * 𝟷𝟶𝟶
    ᴜᴍᴍ = ᴍᴀᴛʜ.ғʟᴏᴏʀ(ᴘᴇʀᴄᴇɴᴛᴀɢᴇ)
    ɪғ 𝟷𝟶 < ᴜᴍᴍ <= 𝟸𝟶:
        ʙᴀʀ = "—◉—————————"
    ᴇʟɪғ 𝟸𝟶 <= ᴜᴍᴍ < 𝟹𝟻:
        ʙᴀʀ = "———◉———————"
    ᴇʟɪғ 𝟹𝟻 <= ᴜᴍᴍ < 𝟻𝟶:
        ʙᴀʀ = "————◉——————"
    ᴇʟɪғ 𝟻𝟶 <= ᴜᴍᴍ < 𝟽𝟻:
        ʙᴀʀ = "—————◉—————"
    ᴇʟɪғ 𝟽𝟻 <= ᴜᴍᴍ < 𝟾𝟶:
        ʙᴀʀ = "——————◉————"
    ᴇʟɪғ 𝟾𝟶 <= ᴜᴍᴍ < 𝟾𝟻:
        ʙᴀʀ = "———————◉———"
    ᴇʟɪғ 𝟾𝟻 <= ᴜᴍᴍ < 𝟿𝟶:
        ʙᴀʀ = "————————◉——"
    ᴇʟɪғ 𝟿𝟶 <= ᴜᴍᴍ < 𝟿𝟻:
        ʙᴀʀ = "—————————◉—"
    ᴇʟɪғ 𝟿𝟻 <= ᴜᴍᴍ < 𝟷𝟶𝟶:
        ʙᴀʀ = "——————————◉"
    ᴇʟsᴇ:
        ʙᴀʀ = "◉——————————"
    ʙᴜᴛᴛᴏɴs = [
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ=ғ"{ᴘʟᴀʏᴇᴅ} •{ʙᴀʀ}• {ᴅᴜʀ}",
                ᴜʀʟ=ғ"ʜᴛᴛᴘs://ᴛ.ᴍᴇ/{ᴀᴘᴘ.ᴜsᴇʀɴᴀᴍᴇ}?sᴛᴀʀᴛɢʀᴏᴜᴘ=ᴛʀᴜᴇ",
            )
        ],
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ=" ᴘʟᴀʏʟɪsᴛ", ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴠɪᴘ_ᴘʟᴀʏʟɪsᴛ {ᴠɪᴅᴇᴏɪᴅ}"
            ),
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ="ᴄᴏɴᴛʀᴏʟs ",
                ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴘᴀɢᴇs ʙᴀᴄᴋ|𝟹|{ᴠɪᴅᴇᴏɪᴅ}|{ᴄʜᴀᴛ_ɪᴅ}",
            ),
        ],
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ=" ᴠɪᴅᴇᴏ", ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴅᴏᴡɴʟᴏᴀᴅᴠɪᴅᴇᴏ {ᴠɪᴅᴇᴏɪᴅ}"
            ),
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ=" ᴀᴜᴅɪᴏ", ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴅᴏᴡɴʟᴏᴀᴅᴀᴜᴅɪᴏ {ᴠɪᴅᴇᴏɪᴅ}"
            ),
        ],
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ=" ᴀʟʟ ғᴇᴀᴛᴜʀᴇs ",
                ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴘᴀɢᴇs ғᴏʀᴡ|𝟶|{ᴠɪᴅᴇᴏɪᴅ}|{ᴄʜᴀᴛ_ɪᴅ}",
            ),
        ],
    ]

    ʀᴇᴛᴜʀɴ ʙᴜᴛᴛᴏɴs


ᴅᴇғ ᴘᴀɴᴇʟ_ᴍᴀʀᴋᴜᴘ_𝟷(_, ᴠɪᴅᴇᴏɪᴅ, ᴄʜᴀᴛ_ɪᴅ):
    ʙᴜᴛᴛᴏɴs = [
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ=_["s_ʙ_𝟻"],
                ᴜʀʟ=ғ"ʜᴛᴛᴘs://ᴛ.ᴍᴇ/{ᴀᴘᴘ.ᴜsᴇʀɴᴀᴍᴇ}?sᴛᴀʀᴛɢʀᴏᴜᴘ=ᴛʀᴜᴇ",
            ),
        ],
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ="🎧 sᴜғғʟᴇ",
                ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴀᴅᴍɪɴ sʜᴜғғʟᴇ|{ᴄʜᴀᴛ_ɪᴅ}",
            ),
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(ᴛᴇxᴛ="ʟᴏᴏᴘ ↺", ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴀᴅᴍɪɴ ʟᴏᴏᴘ|{ᴄʜᴀᴛ_ɪᴅ}"),
        ],
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ="◁ 𝟷𝟶 sᴇᴄ",
                ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴀᴅᴍɪɴ 𝟷|{ᴄʜᴀᴛ_ɪᴅ}",
            ),
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ="𝟷𝟶 sᴇᴄ ▷",
                ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴀᴅᴍɪɴ 𝟸|{ᴄʜᴀᴛ_ɪᴅ}",
            ),
        ],
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ="๏ ʜᴏᴍᴇ ๏",
                ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴘᴀɢᴇs ʙᴀᴄᴋ|𝟸|{ᴠɪᴅᴇᴏɪᴅ}|{ᴄʜᴀᴛ_ɪᴅ}",
            ),
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ="๏ ɴᴇxᴛ ๏",
                ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴘᴀɢᴇs ғᴏʀᴡ|𝟸|{ᴠɪᴅᴇᴏɪᴅ}|{ᴄʜᴀᴛ_ɪᴅ}",
            ),
        ],
    ]
    ʀᴇᴛᴜʀɴ ʙᴜᴛᴛᴏɴs


ᴅᴇғ ᴘᴀɴᴇʟ_ᴍᴀʀᴋᴜᴘ_𝟸(_, ᴠɪᴅᴇᴏɪᴅ, ᴄʜᴀᴛ_ɪᴅ):
    ʙᴜᴛᴛᴏɴs = [
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ=_["s_ʙ_𝟻"],
                ᴜʀʟ=ғ"ʜᴛᴛᴘs://ᴛ.ᴍᴇ/{ᴀᴘᴘ.ᴜsᴇʀɴᴀᴍᴇ}?sᴛᴀʀᴛɢʀᴏᴜᴘ=ᴛʀᴜᴇ",
            ),
        ],
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ="🕒 𝟶.𝟻x",
                ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"sᴘᴇᴇᴅᴜᴘ {ᴄʜᴀᴛ_ɪᴅ}|𝟶.𝟻",
            ),
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ="🕓 𝟷.𝟶x",
                ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"sᴘᴇᴇᴅᴜᴘ {ᴄʜᴀᴛ_ɪᴅ}|𝟷.𝟶",
            ),
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ="🕤 𝟸.𝟶x",
                ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"sᴘᴇᴇᴅᴜᴘ {ᴄʜᴀᴛ_ɪᴅ}|𝟸.𝟶",
            ),
        ],
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ="๏ ᴍᴜᴛᴇ ๏",
                ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴀᴅᴍɪɴ ᴍᴜᴛᴇ|{ᴄʜᴀᴛ_ɪᴅ}",
            ),
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ="๏ ᴜɴᴍᴜᴛᴇ ๏",
                ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴀᴅᴍɪɴ ᴜɴᴍᴜᴛᴇ|{ᴄʜᴀᴛ_ɪᴅ}",
            ),
        ],
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ="๏ ʙᴀᴄᴋ ๏",
                ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴘᴀɢᴇs ʙᴀᴄᴋ|𝟷|{ᴠɪᴅᴇᴏɪᴅ}|{ᴄʜᴀᴛ_ɪᴅ}",
            ),
        ],
    ]
    ʀᴇᴛᴜʀɴ ʙᴜᴛᴛᴏɴs


ᴅᴇғ ᴘᴀɴᴇʟ_ᴍᴀʀᴋᴜᴘ_𝟻(_, ᴠɪᴅᴇᴏɪᴅ, ᴄʜᴀᴛ_ɪᴅ):
    ʙᴜᴛᴛᴏɴs = [
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ=_["s_ʙ_𝟻"],
                ᴜʀʟ=ғ"ʜᴛᴛᴘs://ᴛ.ᴍᴇ/{ᴀᴘᴘ.ᴜsᴇʀɴᴀᴍᴇ}?sᴛᴀʀᴛɢʀᴏᴜᴘ=ᴛʀᴜᴇ",
            ),
        ],
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(ᴛᴇxᴛ="ᴘᴀᴜsᴇ", ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴀᴅᴍɪɴ ᴘᴀᴜsᴇ|{ᴄʜᴀᴛ_ɪᴅ}"),
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(ᴛᴇxᴛ="sᴛᴏᴘ", ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴀᴅᴍɪɴ sᴛᴏᴘ|{ᴄʜᴀᴛ_ɪᴅ}"),
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(ᴛᴇxᴛ="sᴋɪᴘ", ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴀᴅᴍɪɴ sᴋɪᴘ|{ᴄʜᴀᴛ_ɪᴅ}"),
        ],
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ="ʀᴇsᴜᴍᴇ", ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴀᴅᴍɪɴ ʀᴇsᴜᴍᴇ|{ᴄʜᴀᴛ_ɪᴅ}"
            ),
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ="ʀᴇᴘʟᴀʏ", ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴀᴅᴍɪɴ ʀᴇᴘʟᴀʏ|{ᴄʜᴀᴛ_ɪᴅ}"
            ),
        ],
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ="๏ ʙᴀᴄᴋ ๏",
                ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴍᴀɪɴᴍᴀʀᴋᴜᴘ {ᴠɪᴅᴇᴏɪᴅ}|{ᴄʜᴀᴛ_ɪᴅ}",
            ),
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ="๏ ɴᴇxᴛ ๏",
                ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴘᴀɢᴇs ғᴏʀᴡ|𝟷|{ᴠɪᴅᴇᴏɪᴅ}|{ᴄʜᴀᴛ_ɪᴅ}",
            ),
        ],
    ]
    ʀᴇᴛᴜʀɴ ʙᴜᴛᴛᴏɴs


ᴅᴇғ ᴘᴀɴᴇʟ_ᴍᴀʀᴋᴜᴘ_𝟹(_, ᴠɪᴅᴇᴏɪᴅ, ᴄʜᴀᴛ_ɪᴅ):
    ʙᴜᴛᴛᴏɴs = [
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ=_["s_ʙ_𝟻"],
                ᴜʀʟ=ғ"ʜᴛᴛᴘs://ᴛ.ᴍᴇ/{ᴀᴘᴘ.ᴜsᴇʀɴᴀᴍᴇ}?sᴛᴀʀᴛɢʀᴏᴜᴘ=ᴛʀᴜᴇ",
            ),
        ],
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ="🕒 𝟶.𝟻x",
                ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"sᴘᴇᴇᴅᴜᴘ {ᴄʜᴀᴛ_ɪᴅ}|𝟶.𝟻",
            ),
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ="🕓 𝟷.𝟶x",
                ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"sᴘᴇᴇᴅᴜᴘ {ᴄʜᴀᴛ_ɪᴅ}|𝟷.𝟶",
            ),
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ="🕤 𝟸.𝟶x",
                ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"sᴘᴇᴇᴅᴜᴘ {ᴄʜᴀᴛ_ɪᴅ}|𝟸.𝟶",
            ),
        ],
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ="๏ ᴍᴜᴛᴇ ๏",
                ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴀᴅᴍɪɴ ᴍᴜᴛᴇ|{ᴄʜᴀᴛ_ɪᴅ}",
            ),
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ="๏ ᴜɴᴍᴜᴛᴇ ๏",
                ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴀᴅᴍɪɴ ᴜɴᴍᴜᴛᴇ|{ᴄʜᴀᴛ_ɪᴅ}",
            ),
        ],
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ="๏ ʙᴀᴄᴋ ๏",
                ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴘᴀɢᴇs ʙᴀᴄᴋ|𝟷|{ᴠɪᴅᴇᴏɪᴅ}|{ᴄʜᴀᴛ_ɪᴅ}",
            ),
        ],
    ]
    ʀᴇᴛᴜʀɴ ʙᴜᴛᴛᴏɴs


ᴅᴇғ ᴘᴀɴᴇʟ_ᴍᴀʀᴋᴜᴘ_𝟺(_, ᴠɪᴅɪᴅ, ᴄʜᴀᴛ_ɪᴅ, ᴘʟᴀʏᴇᴅ, ᴅᴜʀ):
    ᴘʟᴀʏᴇᴅ_sᴇᴄ = ᴛɪᴍᴇ_ᴛᴏ_sᴇᴄᴏɴᴅs(ᴘʟᴀʏᴇᴅ)
    ᴅᴜʀᴀᴛɪᴏɴ_sᴇᴄ = ᴛɪᴍᴇ_ᴛᴏ_sᴇᴄᴏɴᴅs(ᴅᴜʀ)
    ᴘᴇʀᴄᴇɴᴛᴀɢᴇ = (ᴘʟᴀʏᴇᴅ_sᴇᴄ / ᴅᴜʀᴀᴛɪᴏɴ_sᴇᴄ) * 𝟷𝟶𝟶
    ᴜᴍᴍ = ᴍᴀᴛʜ.ғʟᴏᴏʀ(ᴘᴇʀᴄᴇɴᴛᴀɢᴇ)
    ɪғ 𝟷𝟶 < ᴜᴍᴍ <= 𝟸𝟶:
        ʙᴀʀ = "—◉—————————"
    ᴇʟɪғ 𝟸𝟶 <= ᴜᴍᴍ < 𝟹𝟻:
        ʙᴀʀ = "———◉———————"
    ᴇʟɪғ 𝟹𝟻 <= ᴜᴍᴍ < 𝟻𝟶:
        ʙᴀʀ = "————◉——————"
    ᴇʟɪғ 𝟻𝟶 <= ᴜᴍᴍ < 𝟽𝟻:
        ʙᴀʀ = "—————◉—————"
    ᴇʟɪғ 𝟽𝟻 <= ᴜᴍᴍ < 𝟾𝟶:
        ʙᴀʀ = "——————◉————"
    ᴇʟɪғ 𝟾𝟶 <= ᴜᴍᴍ < 𝟾𝟻:
        ʙᴀʀ = "———————◉———"
    ᴇʟɪғ 𝟾𝟻 <= ᴜᴍᴍ < 𝟿𝟶:
        ʙᴀʀ = "————————◉——"
    ᴇʟɪғ 𝟿𝟶 <= ᴜᴍᴍ < 𝟿𝟻:
        ʙᴀʀ = "—————————◉—"
    ᴇʟɪғ 𝟿𝟻 <= ᴜᴍᴍ < 𝟷𝟶𝟶:
        ʙᴀʀ = "——————————◉"
    ᴇʟsᴇ:
        ʙᴀʀ = "◉——————————"
    ʙᴜᴛᴛᴏɴs = [
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ=ғ"{ᴘʟᴀʏᴇᴅ} •{ʙᴀʀ}• {ᴅᴜʀ}",
                ᴜʀʟ=ғ"ʜᴛᴛᴘs://ᴛ.ᴍᴇ/{ᴀᴘᴘ.ᴜsᴇʀɴᴀᴍᴇ}?sᴛᴀʀᴛɢʀᴏᴜᴘ=ᴛʀᴜᴇ",
            )
        ],
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ="ɪɪ ᴘᴀᴜsᴇ",
                ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴀᴅᴍɪɴ ᴘᴀᴜsᴇ|{ᴄʜᴀᴛ_ɪᴅ}",
            ),
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ="▢ sᴛᴏᴘ ▢", ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴀᴅᴍɪɴ sᴛᴏᴘ|{ᴄʜᴀᴛ_ɪᴅ}"
            ),
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ="sᴋɪᴘ ‣‣ɪ", ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴀᴅᴍɪɴ sᴋɪᴘ|{ᴄʜᴀᴛ_ɪᴅ}"
            ),
        ],
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ="▷ ʀᴇsᴜᴍᴇ", ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴀᴅᴍɪɴ ʀᴇsᴜᴍᴇ|{ᴄʜᴀᴛ_ɪᴅ}"
            ),
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ="ʀᴇᴘʟᴀʏ ↺", ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴀᴅᴍɪɴ ʀᴇᴘʟᴀʏ|{ᴄʜᴀᴛ_ɪᴅ}"
            ),
        ],
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ="๏ ʜᴏᴍᴇ ๏",
                ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴍᴀɪɴᴍᴀʀᴋᴜᴘ {ᴠɪᴅɪᴅ}|{ᴄʜᴀᴛ_ɪᴅ}",
            ),
        ],
    ]

    ʀᴇᴛᴜʀɴ ʙᴜᴛᴛᴏɴs


ᴅᴇғ ᴘᴀɴᴇʟ_ᴍᴀʀᴋᴜᴘ_ᴄʟᴏɴᴇ(_, ᴠɪᴅɪᴅ, ᴄʜᴀᴛ_ɪᴅ):
    ʙᴜᴛᴛᴏɴs = [
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ=_["s_ʙ_𝟻"],
                ᴜʀʟ=ғ"ʜᴛᴛᴘs://ᴛ.ᴍᴇ/{ᴀᴘᴘ.ᴜsᴇʀɴᴀᴍᴇ}?sᴛᴀʀᴛɢʀᴏᴜᴘ=ᴛʀᴜᴇ",
            ),
        ],
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(ᴛᴇxᴛ="▷", ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴀᴅᴍɪɴ ʀᴇsᴜᴍᴇ|{ᴄʜᴀᴛ_ɪᴅ}"),
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(ᴛᴇxᴛ="ɪɪ", ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴀᴅᴍɪɴ ᴘᴀᴜsᴇ|{ᴄʜᴀᴛ_ɪᴅ}"),
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(ᴛᴇxᴛ="↻", ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴀᴅᴍɪɴ ʀᴇᴘʟᴀʏ|{ᴄʜᴀᴛ_ɪᴅ}"),
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(ᴛᴇxᴛ="‣‣ɪ", ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴀᴅᴍɪɴ sᴋɪᴘ|{ᴄʜᴀᴛ_ɪᴅ}"),
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(ᴛᴇxᴛ="▢", ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴀᴅᴍɪɴ sᴛᴏᴘ|{ᴄʜᴀᴛ_ɪᴅ}"),
        ],
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ=" ᴠɪᴅᴇᴏ", ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴅᴏᴡɴʟᴏᴀᴅᴠɪᴅᴇᴏ {ᴠɪᴅɪᴅ}"
            ),
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ=" ᴀᴜᴅɪᴏ", ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴅᴏᴡɴʟᴏᴀᴅᴀᴜᴅɪᴏ {ᴠɪᴅɪᴅ}"
            ),
        ],
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ=" ᴘʟᴀʏʟɪsᴛ ", ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ=ғ"ᴠɪᴘ_ᴘʟᴀʏʟɪsᴛ {ᴠɪᴅɪᴅ}"
            ),
        ],
    ]

    ʀᴇᴛᴜʀɴ ʙᴜᴛᴛᴏɴs


ᴅᴇғ ᴄʟᴏsᴇ_ᴍᴀʀᴋᴜᴘ(_):
    ᴜᴘʟ = ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅᴍᴀʀᴋᴜᴘ(
        [
            [
                ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                    ᴛᴇxᴛ=_["ᴄʟᴏsᴇ_ʙᴜᴛᴛᴏɴ"],
                    ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ="ᴄʟᴏsᴇ",
                ),
            ]
        ]
    )
    ʀᴇᴛᴜʀɴ ᴜᴘʟ
