ғʀᴏᴍ ᴘʏʀᴏɢʀᴀᴍ.ᴛʏᴘᴇs ɪᴍᴘᴏʀᴛ ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ

ɪᴍᴘᴏʀᴛ ᴄᴏɴғɪɢ
ғʀᴏᴍ ᴄᴏɴғɪɢ ɪᴍᴘᴏʀᴛ sᴜᴘᴘᴏʀᴛ_ɢʀᴏᴜᴘ
ғʀᴏᴍ ᴠɪᴘᴍᴜsɪᴄ ɪᴍᴘᴏʀᴛ ᴀᴘᴘ


ᴅᴇғ sᴛᴀʀᴛ_ᴘᴀɴɴᴇʟ(_):
    ʙᴜᴛᴛᴏɴs = [
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ=" ˹𝐀𝙳𝙳 𝙼𝙴 𝙸𝙽 𝙽𝙴𝚆 𝙶𝚁𝙾𝚄𝙿𝚂˼ ",
                ᴜʀʟ=ғ"ʜᴛᴛᴘs://ᴛ.ᴍᴇ/{ᴀᴘᴘ.ᴜsᴇʀɴᴀᴍᴇ}?sᴛᴀʀᴛɢʀᴏᴜᴘ=ᴛʀᴜᴇ",
            ),
        ],
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(ᴛᴇxᴛ="𝐇𝙴𝙻𝙿", ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ="sᴇᴛᴛɪɴɢs_ʙᴀᴄᴋ_ʜᴇʟᴘᴇʀ"),
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(ᴛᴇxᴛ=" 𝐒𝙴𝚃 ", ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ="sᴇᴛᴛɪɴɢs_ʜᴇʟᴘᴇʀ"),
        ],
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(ᴛᴇxᴛ=" 𝐆𝚁𝙾𝚄𝙿 ", ᴜʀʟ=ᴄᴏɴғɪɢ.sᴜᴘᴘᴏʀᴛ_ɢʀᴏᴜᴘ),
        ],
    ]
    ʀᴇᴛᴜʀɴ ʙᴜᴛᴛᴏɴs


ᴅᴇғ ᴘʀɪᴠᴀᴛᴇ_ᴘᴀɴᴇʟ(_):
    ʙᴜᴛᴛᴏɴs = [
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ=" ˹ 𝐀𝙳𝙳 𝙼𝙴 𝙸𝙽 𝙽𝙴𝚆 𝙶𝚁𝙾𝚄𝙿𝚂 ˼ ",
                ᴜʀʟ=ғ"ʜᴛᴛᴘs://ᴛ.ᴍᴇ/{ᴀᴘᴘ.ᴜsᴇʀɴᴀᴍᴇ}?sᴛᴀʀᴛɢʀᴏᴜᴘ=ᴛʀᴜᴇ",
            )
        ],
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(ᴛᴇxᴛ="𝐆𝚁𝙾𝚄𝙿", ᴜʀʟ=ᴄᴏɴғɪɢ.sᴜᴘᴘᴏʀᴛ_ɢʀᴏᴜᴘ),
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(ᴛᴇxᴛ="𝐌ᴏʀᴇ", ᴜʀʟ=ᴄᴏɴғɪɢ.sᴜᴘᴘᴏʀᴛ_ᴄʜᴀɴɴᴇʟ),
        ],
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ=" 𝐅𝙴𝙰𝚃𝚄𝚁𝙴𝚂 ", ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ="sᴇᴛᴛɪɴɢs_ʙᴀᴄᴋ_ʜᴇʟᴘᴇʀ"
            )
        ],
    ]
    ʀᴇᴛᴜʀɴ ʙᴜᴛᴛᴏɴs


ᴅᴇғ ᴀʟɪᴠᴇ_ᴘᴀɴᴇʟ(_):
    ʙᴜᴛᴛᴏɴs = [
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ=" ˹ ᴀᴅᴅ ᴍᴇ ˼ ", ᴜʀʟ=ғ"ʜᴛᴛᴘs://ᴛ.ᴍᴇ/{ᴀᴘᴘ.ᴜsᴇʀɴᴀᴍᴇ}?sᴛᴀʀᴛɢʀᴏᴜᴘ=ᴛʀᴜᴇ"
            ),
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(ᴛᴇxᴛ=_["s_ʙ_𝟹"], ᴜʀʟ=ғ"{sᴜᴘᴘᴏʀᴛ_ɢʀᴏᴜᴘ}"),
        ],
    ]
    ʀᴇᴛᴜʀɴ ʙᴜᴛᴛᴏɴs


ᴅᴇғ ᴍᴜsɪᴄ_sᴛᴀʀᴛ_ᴘᴀɴᴇʟ(_):
    ʙᴜᴛᴛᴏɴs = [
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(
                ᴛᴇxᴛ=" ˹  ᴀᴅᴅ ᴍᴇ ɪɴ ɴᴇᴡ ɢʀᴏᴜᴘ  ˼ ",
                ᴜʀʟ=ғ"ʜᴛᴛᴘs://ᴛ.ᴍᴇ/{ᴀᴘᴘ.ᴜsᴇʀɴᴀᴍᴇ}?sᴛᴀʀᴛɢʀᴏᴜᴘ=ᴛʀᴜᴇ",
            )
        ],
        [
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(ᴛᴇxᴛ="ᴀʙᴏᴜᴛ ", ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ="ᴀʙᴏᴜᴛ"),
            ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(ᴛᴇxᴛ="sᴜᴘᴘᴏʀᴛ ", ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ="sᴜᴘᴘᴏʀᴛ"),
        ],
        [ɪɴʟɪɴᴇᴋᴇʏʙᴏᴀʀᴅʙᴜᴛᴛᴏɴ(ᴛᴇxᴛ=" ғᴇᴀᴛᴜʀᴇ ", ᴄᴀʟʟʙᴀᴄᴋ_ᴅᴀᴛᴀ="ғᴇᴀᴛᴜʀᴇ")],
    ]
    ʀᴇᴛᴜʀɴ ʙᴜᴛᴛᴏɴs
